results/exp1/20260223T201949Z-vanilla-katran/raw/wrk/c64/run-2.txt
Running 1m test @ http://192.168.100.100:8080/exp1-1k.txt
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   253.90us   52.78us   2.68ms   72.67%
    Req/Sec    62.26k     4.85k   86.62k    75.99%
  Latency Distribution
     50%  248.00us
     75%  274.00us
     90%  332.00us
     99%  392.00us
  14886750 requests in 1.00m, 17.65GB read
Requests/sec: 247700.62
Transfer/sec:    300.71MB